
def area(a):
    '''
    
    Вычисляет площадь квадрата по заданной длине стороны. 
    
    Параметры: 
    a (float): длина стороны квадрата
    
    Возвращаемое значение:
    (float): плоащдь квадрата 
    
    Пример вызова: 
    >> area(8)
    64
    
    '''
    return a * a


def perimeter(a):
    '''
    
    Вычисляет периметр квадрата по заданной длине стороны.
    
    Параметры: 
    a (float): длина стороны квадрата
    
    Возвращаемое значение: 
    (float): периметр квадрата
    
    Пример вызова: 
    >> perimeter(10)
    40 
    
    '''
    return 4 * a
